; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 14214)
	(= (fuel plane1) 4388)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city1)
	(= (capacity plane2) 2814)
	(= (fuel plane2) 896)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 8)
	(at person1 city8)
	(at person2 city0)
	(at person3 city2)
	(at person4 city8)
	(at person5 city3)
	(at person6 city0)
	(at person7 city8)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 508)
	(= (distance city0 city2) 665)
	(= (distance city0 city3) 554)
	(= (distance city0 city4) 573)
	(= (distance city0 city5) 835)
	(= (distance city0 city6) 701)
	(= (distance city0 city7) 870)
	(= (distance city0 city8) 966)
	(= (distance city1 city0) 508)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 924)
	(= (distance city1 city3) 958)
	(= (distance city1 city4) 899)
	(= (distance city1 city5) 603)
	(= (distance city1 city6) 637)
	(= (distance city1 city7) 757)
	(= (distance city1 city8) 607)
	(= (distance city2 city0) 665)
	(= (distance city2 city1) 924)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 950)
	(= (distance city2 city4) 967)
	(= (distance city2 city5) 600)
	(= (distance city2 city6) 975)
	(= (distance city2 city7) 843)
	(= (distance city2 city8) 901)
	(= (distance city3 city0) 554)
	(= (distance city3 city1) 958)
	(= (distance city3 city2) 950)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 855)
	(= (distance city3 city5) 892)
	(= (distance city3 city6) 541)
	(= (distance city3 city7) 816)
	(= (distance city3 city8) 552)
	(= (distance city4 city0) 573)
	(= (distance city4 city1) 899)
	(= (distance city4 city2) 967)
	(= (distance city4 city3) 855)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 934)
	(= (distance city4 city6) 809)
	(= (distance city4 city7) 527)
	(= (distance city4 city8) 505)
	(= (distance city5 city0) 835)
	(= (distance city5 city1) 603)
	(= (distance city5 city2) 600)
	(= (distance city5 city3) 892)
	(= (distance city5 city4) 934)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 553)
	(= (distance city5 city7) 536)
	(= (distance city5 city8) 670)
	(= (distance city6 city0) 701)
	(= (distance city6 city1) 637)
	(= (distance city6 city2) 975)
	(= (distance city6 city3) 541)
	(= (distance city6 city4) 809)
	(= (distance city6 city5) 553)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 608)
	(= (distance city6 city8) 609)
	(= (distance city7 city0) 870)
	(= (distance city7 city1) 757)
	(= (distance city7 city2) 843)
	(= (distance city7 city3) 816)
	(= (distance city7 city4) 527)
	(= (distance city7 city5) 536)
	(= (distance city7 city6) 608)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 505)
	(= (distance city8 city0) 966)
	(= (distance city8 city1) 607)
	(= (distance city8 city2) 901)
	(= (distance city8 city3) 552)
	(= (distance city8 city4) 505)
	(= (distance city8 city5) 670)
	(= (distance city8 city6) 609)
	(= (distance city8 city7) 505)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city0)
	(at person1 city7)
	(at person2 city8)
	(at person3 city1)
	(at person4 city0)
	(at person5 city8)
	(at person6 city0)
	(at person7 city1)
	))

(:metric minimize (+ (* 1 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (fly plane1 city5 city2)
   deleted: (at plane1 city5)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 3000, (fuel plane1) from 4388 to 1388
   goals met: 1 of 8
2. (board person3 plane1 city2)
   deleted: (at person3 city2)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 8
3. (fly plane2 city1 city0)
   deleted: (at plane2 city1)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 3000 to 3508, (fuel plane2) from 896 to 388
   goals met: 2 of 8
4. (refuel plane1 city2)
   changed: (fuel plane1) from 1388 to 14214
   goals met: 2 of 8
5. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 3508 to 8128, (fuel plane1) from 14214 to 9594
   goals met: 2 of 8
6. (debark person3 plane1 city1)
   deleted: (in person3 plane1)
   added: (at person3 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 8
7. (fly plane1 city1 city8)
   deleted: (at plane1 city1)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 8128 to 11163, (fuel plane1) from 9594 to 6559
   goals met: 3 of 8
8. (board person7 plane1 city8)
   deleted: (at person7 city8)
   added: (in person7 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 8
9. (board person1 plane1 city8)
   deleted: (at person1 city8)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 8
10. (board person4 plane1 city8)
   deleted: (at person4 city8)
   added: (in person4 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 8
11. (fly plane1 city8 city7)
   deleted: (at plane1 city8)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 11163 to 13688, (fuel plane1) from 6559 to 4034
   goals met: 3 of 8
12. (board person2 plane2 city0)
   deleted: (at person2 city0)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 8
13. (refuel plane2 city0)
   changed: (fuel plane2) from 388 to 2814
   goals met: 3 of 8
14. (debark person1 plane1 city7)
   deleted: (in person1 plane1)
   added: (at person1 city7)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 8
15. (fly plane1 city7 city1)
   deleted: (at plane1 city7)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 13688 to 17473, (fuel plane1) from 4034 to 249
   goals met: 4 of 8
16. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 8
17. (fly plane2 city0 city8)
   deleted: (at plane2 city0)
   added: (at plane2 city8)
   changed: (total-fuel-used) from 17473 to 18439, (fuel plane2) from 2814 to 1848
   goals met: 4 of 8
18. (debark person2 plane2 city8)
   deleted: (in person2 plane2)
   added: (at person2 city8)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 8
19. (fly plane2 city8 city0)
   deleted: (at plane2 city8)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 18439 to 19405, (fuel plane2) from 1848 to 882
   goals met: 6 of 8
20. (refuel plane1 city1)
   changed: (fuel plane1) from 249 to 14214
   goals met: 6 of 8
21. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 19405 to 21945, (fuel plane1) from 14214 to 11674
   goals met: 6 of 8
22. (debark person4 plane1 city0)
   deleted: (in person4 plane1)
   added: (at person4 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 8
23. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 21945 to 24715, (fuel plane1) from 11674 to 8904
   goals met: 7 of 8
24. (board person5 plane1 city3)
   deleted: (at person5 city3)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 8
25. (fly plane1 city3 city8)
   deleted: (at plane1 city3)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 24715 to 27475, (fuel plane1) from 8904 to 6144
   goals met: 7 of 8
26. (debark person5 plane1 city8)
   deleted: (in person5 plane1)
   added: (at person5 city8)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 8
